# Taps
tap "antoniorodr/memo"              # Memo CLI tool
tap "hashicorp/tap"                 # HashiCorp official tap
tap "homebrew/services"             # Homebrew services management
tap "steipete/tap"                  # remindctl and other tools
tap "upcloudltd/tap"                # UpCloud CLI
tap "yakitrak/yakitrak"             # Obsidian CLI

# Formulae — CLI tools and languages
brew "awscli"                       # AWS command-line interface
brew "cdk"                          # AWS CDK CLI
brew "conftest"                     # Policy testing for config files
brew "direnv"                       # Per-directory environment variables
brew "entr"                         # Run commands when files change
brew "gh"                           # GitHub CLI
brew "git-lfs"                      # Git Large File Storage
brew "go"                           # Go programming language
brew "htop"                         # Interactive process viewer
brew "imagemagick"                  # Image manipulation tools
brew "opentofu"                     # Terraform-compatible IaC tool
brew "pipx"                         # Install Python CLI tools in isolation
brew "pnpm"                         # Fast, disk-efficient package manager
brew "pre-commit"                   # Git pre-commit hook framework
brew "protobuf"                     # Protocol Buffers compiler
brew "pyenv"                        # Python version manager
brew "python@3.11"                  # Python 3.11
brew "python@3.12"                  # Python 3.12
brew "ripgrep"                      # Fast recursive search (rg)
brew "sqlc"                         # Generate Go code from SQL
brew "tailwindcss"                  # Tailwind CSS CLI
brew "tree"                         # Directory listing as tree
brew "zsh-autosuggestions"          # Fish-like autosuggestions for zsh
brew "zsh-syntax-highlighting"      # Syntax highlighting for zsh

# Formulae — from third-party taps
brew "antoniorodr/memo/memo"        # Memo CLI
brew "hashicorp/tap/terraform"      # Terraform IaC tool
brew "steipete/tap/remindctl"       # Apple Reminders CLI
brew "yakitrak/yakitrak/obsidian-cli" # Obsidian vault CLI

# Casks — Dev tools
cask "cursor"                       # AI-powered code editor
cask "ghostty"                      # GPU-accelerated terminal emulator
cask "orbstack"                     # Fast Docker & Linux on macOS
cask "session-manager-plugin"       # AWS Session Manager plugin
cask "sf-symbols"                   # Apple SF Symbols browser
cask "zed"                          # High-performance code editor

# Casks — Productivity
cask "claude"                       # Anthropic Claude desktop app
cask "linear-linear"                # Project management
cask "notion"                       # Notes and docs
cask "obsidian"                     # Markdown knowledge base
cask "perplexity"                   # AI search engine
cask "raycast"                      # Launcher and productivity
cask "slack"                        # Team messaging
cask "telegram"                     # Messaging app

# Casks — Browsers
cask "brave-browser"                # Privacy-focused browser
cask "thebrowsercompany-dia"        # Dia

# Casks — Media
cask "spotify"                      # Music streaming
