a-h.templ
ambar.bundle-size
anthropic.claude-code
anysphere.cursorpyright
biomejs.biome
bradlc.vscode-tailwindcss
eamodio.gitlens
github.vscode-github-actions
golang.go
hashicorp.terraform
humao.rest-client
mechatroner.rainbow-csv
mhutchie.git-graph
mjmlio.vscode-mjml
ms-python.python
ms-python.vscode-pylance
ms-toolsai.jupyter
ms-vscode.makefile-tools
ms-vsliveshare.vsliveshare
naumovs.color-highlight
pkief.material-icon-theme
redhat.vscode-yaml
typescriptteam.native-preview
vitest.explorer
